workstation.org
#+PROPERTY: header-args :comments both :noweb yes
#+OPTIONS: ^:nil ;; let an underscore be an underscore, disable sub-superscripting
#+OPTIONS: timestamp:nil
#+TITLE: Workstation
* Introduction: A Repeatable Workstation Configuration
This is my workstation configuration.

By default, our workstations are a hodge-podge of tweaks that accumulate
over the years. Quite often files etc are left over from old software we use.
Worse, files will be left over from old *versions* of software that we still
use. This makes it very confusing to tell what is essential and what is disjecta
membra.

This is my attempt to fix all that for myself, and perhaps you, dear reader, may
find it of use as well. If you have any questions, feel free to shoot me an
email or open an issue (honestly, it would be somewhat nice to know that at
least *one* other person has read this).
** Rationale: The Problem
Have you ever had a tool or setup break and had a devil of a time trying to get
it back to a working state? Over the years, I've set up many new tools to help
me with my work. But, time passes,
and things break. Sometimes I don't even notice they've broken for a long time,
so its even harder to fix. Something must have change must have changed: a
dependency, perhaps? or filesystem contents?
Or, even, perhaps I've forgotten how it is supposed to work.

This has been tricky to resolve. Especially if the tool is a hack I put
together.

What is more, to reach higher levels of productivty, it is essential to research,
develop, and use new tools for ourselves. Each of us has our own needs and
constraints. However, without a firm foundation, these rube-goldberg development
approaches are very fragile.

So, I have been trying to do just this: provide myself a repeatable, executable
workstation setup which I can extend when needed and rely on if something
unforseen happens (e.g. laptop breaks).

One final point: I've noticed over the years that there is a subtle pressure to
not install new things because I *know* it will cause a problem for me in the
future. But I think this is an anti-pattern, and needs to be fought against!
** Design choices
*** Requirements
- open source
- hackable
- where reasonable, use repeatable, automatable solutions
*** Invariants checking
It is necessary to check that the computer satisfies stated requirements.
This might mean anything from "user can successfully use sudo" to "I can compile
haskell source files".

Basically, this can take shape as a script I run regularly, but more ideally it
would (also) be something that is automatically run and have information
reported to me.

Currently, the intention is that this will come in the form of running ~ws
check~, which is a part of the wshs sub-project in the wshs directory.
*** early problem reporting
Ideally, we'd like to know about problems asap. If a new update comes out, and
our whole setup proces is flawed somehow with the new update, it is important to
realize and address when I can.
* Background and History
I have had a few different setups over the
years. Accomplishing this is a lot harder than I expected.
** Literate Programming
In my experience, these workstation projects are easy to put aside for a long
time, and when you come back you can't remember how things were built.

So, this project is mostly written with literate
org mode. This gives me an easy way to document my thoughts as I work, and also
explore using ~org-mode~ for this task. I did this same thing a long time ago
with my old dotfiles setup, and I liked it, but everything else about it was a
massive pain, so it was eventually abandoned.

If you want to see how literate programming works in org mode, view this raw file.
* README
#+begin_src md :tangle ./README.md  :noweb yes :comments none
WARNING: this file is managed by tangling the file workstation.org. Do not edit directly!

# Instructions

1. download the bootstrap shell script:
`curl https://raw.githubusercontent.com/joelmccracken/workstation/master/bootstrap-workstation.sh > bootstrap-workstation.sh`
2. run `bash bootstrap-workstation.sh MACHINE_NAME BRANCH
3. Profit!
4. See workstation.org for manual setup documentation
# More Information

Much more information may be found in
<a href="workstation.org">workstation.org</a>.
#+end_src
* Makefile
Used to tangle ~workstation.org~. Tangling refers to the
process of taking a literate program source and converting it to the target
"source" file for execution.

Formerly had some other targets, but now they are OBE. It may make sense to
delete this makefile if it becomes clearly unnecessary.
#+begin_src makefile :tangle ./Makefile  :noweb yes
all: tangle

tangle:
	bash bin/tangle.sh

.PHONY: tangle
#+end_src

Which requires a shell script:

#+begin_src sh :shebang "#!/usr/bin/env bash" :tangle ./bin/tangle.sh
source ${WORKSTATION_DIR}/lib/shell/foundation.sh
$WORKSTATION_EMACS_CONFIG_DIR/bin/doomscript lib/emacs/tangle-file.el
#+end_src

And a little emacs lisp that goes with the tangle process:
#+begin_src emacs-lisp :tangle ./lib/emacs/tangle-file.el
;;; tangle-file.el --- description -*- lexical-binding: t; -*-

(setq safe-local-variable-values
      '((org-babel-noweb-wrap-start . "«")
        (org-babel-noweb-wrap-end . "»")))

(doom-require 'doom-start)

(defun do-tangle ()
  "Do the tangle"
  (find-file "workstation.org")
  (org-babel-tangle))

(do-tangle)

(provide 'tangle-file)

;;; tangle-file.el ends here
#+end_src
* Bootstrap process
Bootstrapping is tricky. What do you actually start with? What can you assume?
You want to keep the amount of manual steps which need to occur to a minimum.
I start start with a shell script.
This script could either do the entire setup process, or
theoretically it could also prepare the way for another process.

For me, I currently basically have a single bash script. But what I want to do
soon is change this so that its a bash script which invokes a haskell process asap.
so the bash script would basically do the minimum amount required to set up
everything for the haskell process. This is still a work in progress, and since
this project is starting to stablize, I may abandon the haskell portion of the
setup.
** Bootstraping Script
This script is intended to be entrypoint to this project. It can be curled to a
new machine and then run, and will set things up on that machine as necessary.

The steps to the setup are given more details in
[[*Bootstrap Script Execution Process][Bootstrap Script Execution Process]].
#+begin_src sh :shebang "#!/usr/bin/env bash" :tangle ./bootstrap-workstation.sh :noweb yes

set -xeuo pipefail

«bootstrap-steps»

#+end_src
** Bootstrap Script Execution Process
:PROPERTIES:
:header-args: :noweb-ref bootstrap-steps :comments noweb
:ID:       74975286-5772-4094-8077-052d7eb35f14
:END:
This portion of the document explains the various execution steps of bootstrap.

Each of these steps are executed sequentially.
*** Argument Parsing
#+begin_src shell
# Script should be passed a single argument, which is name of this workstation.

# When using script to set up a workstation, the "name" of the workstation should
# be provided as the first argument. This is used to pick which settings should be
# applied to this machine.
if [ -z "${1+x}" ]; then
    echo WORKSTATION_NAME must be provided as first argument
    exit 2
else
    export WORKSTATION_NAME="$1"
fi

# This argument generally should not be used by the user, but it is needed for
# the CI process.
# When the CI process starts, we start out with a check out of the code for this
# commit in a directory on the CI machine. However, this is not how workstation runs:
# - part of the job of workstation is getting its own code from the server
# - workstation expects the code to be in a specific directory, that is, ~/workstation
# Because of this (and possibly other reasons that escape me now), even though the
# source code of the current commit is checked out on the CI machine already,
# the CI process re-downloads the code (via this script). The specific SHA to get
# is passed via the argument below. However, if actually being used by a user,
# generally user will always want to use the most up to date content of the master
# branch, so this can be ignored.
# I think probably this sha should just be passed in as an environment variable
# instead of a CLI argument, as that seems a bit less confusing to me.
if [ -z "${2+x}" ]; then
    export WORKSTATION_BOOTSTRAP_COMMIT=origin/master
else
    export WORKSTATION_BOOTSTRAP_COMMIT="$2"
fi
#+end_src
*** Foundations
#+begin_src shell :noweb yes
«workstation_foundation»
#+end_src
*** Set Version Settings
#+begin_src shell :noweb yes
# These are the various versions of things that should be installed. Keeping them
# in one place like this make them easier to keep track of.
«workstation_setup_versions»
#+end_src
*** Helper and Component Functions
#+begin_src shell :noweb yes
# hereafter, we use many helper functions. Here they are defined up front,
# as some of them are used throughout the other code.

«is_mac_function»

«is_linux_function»

«info_function»

«polite_git_checkout_function»

«mv_dated_backup_function»

«is_git_repo_cloned_at_function»

«clone_repo_and_checkout_at_function»

«xcode_setup_function»

«is_brew_installed_function»

«homebrew_setup_function»

«update_apt_install_git_function»

«is_git_repo_cloned_at_function»

«clone_repo_and_checkout_at_function»
#+end_src
*** Log that bootstrap is starting
#+begin_src shell
info starting workstation bootstrap
#+end_src
*** macos only: ensure xcode, homebrew, and git are ready to go
#+begin_src shell :noweb yes
is_mac && {
    info ensuring xcode is installed
    xcode_setup
    info finished ensuring xcode is installed

    info ensuring brew is installed
    if ! is_brew_installed; then
        homebrew_setup
    fi
    info finished ensuring brew is installed

    info installing git
    brew install git
    info finished installing git

}
#+end_src
*** (ubuntu) linux only: update apt and install git
#+begin_src shell :noweb yes
is_linux && {
    info updating apt, installing git
    update_apt_install_git
    info finished updating apt, installing git
}
#+end_src
*** check out correct workstation commit
#+begin_src shell :noweb yes
is_git_repo_cloned_at $WORKSTATION_DIR $WORKSTATION_GIT_ORIGIN || {
    clone_repo_and_checkout_at $WORKSTATION_DIR $WORKSTATION_GIT_ORIGIN_PUB \
        $WORKSTATION_BOOTSTRAP_COMMIT $WORKSTATION_GIT_ORIGIN
}
#+end_src
*** check out the dotfiles repository
TODO this should probably change, it would almost certainly be better to set
this up somewhow without some other repo. I could likely achieve the same
outcome by just creating a git repo in ~ without any origin, and then figuring
out

#+begin_src shell :noweb yes
# at this point, this is hardly necessary; however, the gitignore file is handy
# i may explore getting rid of this repo entirely and just having a fresh
# repo without any origin in ~
info ensuring dotfiles repo is checked out

DOTFILES_ORIGIN='git@github.com:joelmccracken/dotfiles.git'

is_git_repo_cloned_at ~ "$DOTFILES_ORIGIN" ||
    polite-git-checkout ~ 'https://github.com/joelmccracken/dotfiles.git' \
        "$DOTFILES_ORIGIN"

info finished ensuring dotfiles repo is checked out
#+end_src
*** set up host specific settings
#+begin_src shell :noweb yes
${WORKSTATION_DIR}/lib/shell/setup/link-host-dir.sh "$WORKSTATION_NAME"
#+end_src
*** set up nix
#+begin_src shell :noweb yes

info ensuring nix is installed
${WORKSTATION_DIR}/lib/shell/setup/ensure_nix_installed.sh

info finished ensuring nix is installed

info setting up nix.conf
${WORKSTATION_DIR}/lib/shell/setup/install_system_nix_conf.sh

info restarting nix daemon
${WORKSTATION_DIR}/lib/shell/setup/restart_nix_daemon.sh
info nix daemon restarted

NIX_DAEMON_PATH='/nix/var/nix/profiles/default/etc/profile.d/nix-daemon.sh'
set +u
source "$NIX_DAEMON_PATH";
set -u

#+end_src
*** install nix darwin
#+begin_src shell :noweb yes

is_mac && {
    info installing darwin-nix
    ${WORKSTATION_DIR}/lib/shell/setup/install_nix_darwin.sh
    info finished installing darwin-nix
}

#+end_src
*** install home manager
#+begin_src shell :noweb yes

${WORKSTATION_DIR}/lib/shell/setup/install_home_manager.sh

${WORKSTATION_DIR}/lib/shell/setup/home-manager-flake-switch.sh

set +u
# evaluating this with set -u will cause an unbound variable error
source $HOME/.nix-profile/etc/profile.d/hm-session-vars.sh
set -u

#+end_src
*** install doom emacs
Unfortunately, because of some problems that are highly detailed (which are too
much to get into here), the project nix-doom-emacs doesn't work for my purposes,
and so while emacs itself is installed via nix, doom does its own package
management.
#+begin_src shell :noweb yes
${WORKSTATION_DIR}/lib/shell/setup/install_doom_emacs_no_nix.sh
#+end_src
*** link dotfiles into place
Note: this must be before wshs is run otherwise when ~ws~ runs ~brew bundle~, it
will fail.

#+begin_src shell :noweb yes
info linking dotfiles that should be symlinked
bash ${WORKSTATION_DIR}/lib/shell/setup/link-dotfiles.sh -f -c
info finished linking dotfiles
#+end_src
*** set up 'ws' workstation tool
#+begin_src shell :noweb yes
info "building the 'ws' script"
${WORKSTATION_DIR}/lib/shell/setup/build_ws_tool.sh

info "running the 'ws install' process"
${WORKSTATION_DIR}/lib/shell/setup/ws_install.sh
info "'ws install' process completed"
#+end_src
*** link dotfiles into place
#+begin_src shell :noweb yes

info linking dotfiles that should be symlinked
bash ${WORKSTATION_DIR}/lib/shell/setup/link-dotfiles.sh -f -c
info finished linking dotfiles
#+end_src
*** set up workstation secrets
#+begin_src shell :noweb yes
bash ${WORKSTATION_DIR}/lib/shell/setup/initial_bitwarden_sync.sh
#+end_src
*** output final manual setup notes
#+begin_src shell :noweb yes

cat <<-EOF
Success! However, there are some remaining manual set up steps required.
«manual-setup-instructions»
EOF
#+end_src
** Bootstrapping Components
There are many components
Many of these snippets are also provided as separate scripts in the workstation
repository. It is handy to have these quickly available if I am debugging a
problem; the alternative, frequently, is to reconstruct these things ad-hoc.

For that matter, thinking about extracting things from the giant install file
into pieces is helpful.
*** Helper Functions
**** is_mac
Detects if is running on a mac.

#+NAME: is_mac_function
#+begin_src sh
function is_mac() {
    [[ "$(uname)" == 'Darwin' ]]
}
#+end_src
**** is_linux
Detects if running on linux
#+NAME: is_linux_function
#+begin_src sh
function is_linux() {
    [[ "$(uname)" == 'Linux' ]]
}
#+end_src
**** info
A simple function for logging.
#+NAME: info_function
#+begin_src sh
function info() {
    echo "INFO ========= $(date) $@"
}
#+end_src
**** mv_dated_backup
#+name: mv_dated_backup_function
#+begin_src shell
function mv_dated_backup() {
    local THEDIR="$1"
    if test -e "$THEDIR"; then
        mv "$THEDIR" "${THEDIR}-$(date +"%s")"
    fi
}
#+end_src
**** is_git_repo_cloned_at
Utility function to see if a git repo is checked out
Use the origin url as an approximate way to check if its checked out
#+name: is_git_repo_cloned_at_function
#+begin_src shell
function is_git_repo_cloned_at(){
    cd $1 && [[ "$(git remote get-url origin)" == "$2" ]]
}
#+end_src
**** clone_repo_and_checkout_at
#+name: clone_repo_and_checkout_at_function
#+begin_src shell
function clone_repo_and_checkout_at() {
    mv_dated_backup $1
    info cloning repo into $1
    git clone $2 $1
    cd $1
    info checking out commit $3
    git checkout $3
    info setting origin
    git remote set-url origin $4
}
#+end_src
