workstation.org
*** Versions
The versions of various things that are installed as part of the bootstrapping
process. Sometimes I need to update these, having them contained in one spot is
helpful.
#+name: workstation_setup_versions
#+begin_src sh :tangle ./lib/shell/setup/workstation_setup_versions.sh :noweb yes
export WORKSTATION_NIX_PM_VERSION=nix-2.11.1
export WORKSTATION_NIX_DARWIN_VERSION=f6648ca0698d1611d7eadfa72b122252b833f86c
export WORKSTATION_HOME_MANAGER_VERSION=0f4e5b4999fd6a42ece5da8a3a2439a50e48e486
#+end_src
*** setting up xcode (macos)
#+name: xcode_setup_function
#+begin_src shell
function xcode_setup() {
    # this will accept the license that xcode requires from the command line
    # and also install xcode if required.
    sudo bash -c '(xcodebuild -license accept; xcode-select --install) || exit 0'
}
#+end_src
External Script:
#+begin_src sh :tangle ./lib/shell/setup/xcode_setup.sh :shebang "#!/usr/bin/env bash" :noweb yes
«xcode_setup_function»
xcode_setup
#+end_src
*** check if brew is installed (macos)
#+name: is_brew_installed_function
#+begin_src shell
function is_brew_installed() {
    which brew > /dev/null
}
#+end_src
External Script:
#+begin_src sh :tangle ./lib/shell/setup/is_brew_installed.sh :shebang "#!/usr/bin/env bash" :noweb yes
«is_brew_installed_function»
is_brew_installed
#+end_src
*** set up homebrew (macos)
#+name: homebrew_setup_function
#+begin_src shell
function homebrew_setup() {
    /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
}
#+end_src
External Script:
#+begin_src sh :tangle ./lib/shell/setup/homebrew_setup.sh :shebang "#!/usr/bin/env bash" :noweb yes
«homebrew_setup_function»
homebrew_setup
#+end_src

*** update apt and install git
#+name: update_apt_install_git_function
#+begin_src shell :noweb yes
function update_apt_install_git() {
    sudo bash -c 'apt-get update && apt-get install git'
}
#+end_src
External Script:
#+begin_src sh :tangle ./lib/shell/setup/update_apt_install_git.sh :shebang "#!/usr/bin/env bash" :noweb yes
«update_apt_install_git_function»
update_apt_install_git
#+end_src
*** install nix configuration file
I wish I could do this with a nix-like thing, but sadly, there are several
complications.
- for MacOS, this is nix-darwin.
- for Ubuntu, there is nothing that can do it.
- There _is_ a way to do something similar with home manager, but it sets the
  _user_ nix settings, _not_ the system settings. This is not overly surprising,
  but it does mean that it can't be the sole solution for setting
  configurations, if you need to set up caches/substituters.
  At the very least, I would need some *other* way besides home manager to
  sepecify that my user is a trusted user. But, then, there becomes a question
  of bootstrapping (nix settings needed before home manager ever runs), so I
  think its overall easier to just hack a thing with bash.
#+begin_src sh :tangle ./lib/shell/setup/install_system_nix_conf.sh :shebang "#!/usr/bin/env bash" :noweb yes
function emit_nix_conf_content () {
    cat - <<-EOF
# Generated at $(date)
trusted-public-keys = cache.nixos.org-1:6NCHdD59X431o0gWypbMrAURkbJ16ZPMQFGspcDShjY= hydra.iohk.io:f/Ea+s+dFdN+3Y/G+FDgSq+a5NEWhJGzdjvKNGv0/EQ=
substituters = https://cache.nixos.org https://cache.iog.io
experimental-features = nix-command flakes
trusted-users = root $(whoami) runner
build-users-group = nixbld
# END OF /etc/nix/nix.conf
EOF
}

emit_nix_conf_content | \
    sudo bash -c 'mkdir -p /etc/nix; cat > /etc/nix/nix.conf'

#+end_src
*** restart nix daemons
Sometimes we need to restart the nix daemons, e.g. after editing the nix config
file.
#+begin_src sh :tangle ./lib/shell/setup/restart_nix_daemon.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/lib/shell/funcs.sh
function restart_nix_daemon_linux() {
    sudo systemctl restart nix-daemon.service;
}

function restart_nix_daemon_mac() {
    set +e
    sudo launchctl unload /Library/LaunchDaemons/org.nixos.nix-daemon.plist
    sudo launchctl load /Library/LaunchDaemons/org.nixos.nix-daemon.plist
    set -e
}

if is_mac; then  restart_nix_daemon_mac; fi
if is_linux; then restart_nix_daemon_linux; fi
#+end_src
*** Install Nix
#+begin_src sh :tangle ./lib/shell/setup/ensure_nix_installed.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/lib/shell/setup/workstation_setup_versions.sh
source ${WORKSTATION_DIR}/lib/shell/funcs.sh

if which nix > /dev/null; then
    info "nix exists in path, not installing"
else
    info "nix not in path, installing"
    sh <(curl -L https://releases.nixos.org/nix/$WORKSTATION_NIX_PM_VERSION/install) --daemon;
fi

#+end_src
*** Install doom emacs without nix
#+begin_src sh :tangle ./lib/shell/setup/install_doom_emacs_no_nix.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/lib/shell/foundation.sh

{
    cd $WORKSTATION_EMACS_CONFIG_DIR
    [[ "$(git remote get-url origin)" == 'https://github.com/hlissner/doom-emacs' ]]
} || {
    mv_dated_backup $WORKSTATION_EMACS_CONFIG_DIR
    time git clone --depth 1 https://github.com/doomemacs/doomemacs $WORKSTATION_EMACS_CONFIG_DIR/
    # alternative: use this if encounter problems
    # ~/.emacs.d/bin/doom -y install;
    # time timeout 45m bash -c 'yes | ~/.emacs.d/bin/doom install' || exit 0
    # time bash -c 'yes | ~/.emacs.d/bin/doom install' || exit 0
    time timeout 60m bash -c "yes | $WORKSTATION_EMACS_CONFIG_DIR/bin/doom install" || exit 0
    $WORKSTATION_EMACS_CONFIG_DIR/bin/doom sync
    echo FINISHED INSTALLING DOOM;
}

#+end_src

*** Build WS tool
#+begin_src sh :tangle ./lib/shell/setup/build_ws_tool.sh :shebang "#!/usr/bin/env bash" :noweb yes
cd  ${WORKSTATION_DIR}/wshs
nix build --no-link -L .#"wshs:exe:bww" .#"wshs:exe:ws"
#+end_src
*** Run WS install
#+begin_src sh :tangle ./lib/shell/setup/ws_install.sh :shebang "#!/usr/bin/env bash" :noweb yes
cd  ${WORKSTATION_DIR}/wshs
$(nix path-info .#"wshs:exe:ws")/bin/ws install -m "$WORKSTATION_NAME";
#+end_src
*** Install nix-darwin
#+begin_src sh :tangle ./lib/shell/setup/install_nix_darwin.sh :shebang "#!/usr/bin/env bash" :noweb yes

source ${WORKSTATION_DIR}/lib/shell/foundation.sh
source ${WORKSTATION_DIR}/lib/shell/setup/workstation_setup_versions.sh

cd $WORKSTATION_DIR
nix-build https://github.com/LnL7/nix-darwin/archive/${WORKSTATION_NIX_DARWIN_VERSION}.tar.gz -A installer
./result/bin/darwin-installer

source ${WORKSTATION_DIR}/lib/shell/setup/nix-darwin-rebuild-flake.sh

#+end_src
*** Install home manager
#+begin_src sh :tangle ./lib/shell/setup/install_home_manager.sh :shebang "#!/usr/bin/env bash" :noweb yes
export HOME_MANAGER_BACKUP_EXT=old

nix run home-manager/$WORKSTATION_HOME_MANAGER_VERSION -- init ~/workstation
#+end_src

*** Initial Bitwarden Sync
#+name: initial_bitwarden_sync_function
#+begin_src shell

# The initial BitWarden Sync process. Requires wshs/bww executable to
# be built and available. This could all be more robust
# extracting it is theoretically useful as it provides a mechanism for
# resetting the secrets.
# Likely this should be broken down into separate functions that can be reused.
function initial_bitwarden_sync() {
    # why is bash so cryptic
    if [ ! -z "${BW_CLIENTID+x}" ] && \
       [ ! -z "${BW_CLIENTSECRET+x}" ] && \
       [ ! -z "${WS_BW_MASTER_PASS+x}" ]; then
        info variables requried to run bww force-sync are set, running
        if [ ! -d ~/secrets ]; then
            mkdir ~/secrets;
        fi
        cd  ${WORKSTATION_DIR}/wshs
        # overwriting anything that was previously in the file
        echo "${WS_BW_MASTER_PASS}" > ~/secrets/bw_pass
        bw login --apikey
        bw_unlock
        bw sync
        $(nix path-info .#"wshs:exe:bww")/bin/bww force-sync
    else
        info variables required to run bww force sync are MISSING, skipping
    fi
}

#+end_src

#+begin_src sh :tangle ./lib/shell/setup/initial_bitwarden_sync.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/lib/shell/funcs.sh

«initial_bitwarden_sync_function»
initial_bitwarden_sync

#+end_src
*** setting directories for current host
Each workstaion host I use has different settings needs. My remote cloud hosted
server has a different setup than my mac laptop, which has a different set up
from my work computer. The way I have these settings specified is by having a
directory in my home directory which has all of the needed files to
specify such differences. There are different directories for each host I
maintain, but on a specific, individual host, one of those directories are symlinked
into the 'current' (src_text{~/workstation/hosts/current/})
directory, and various workstation components are programmed to look
in this location for their code/settings as appropriate.

#+begin_src sh :tangle ./lib/shell/setup/link-host-dir.sh :shebang "#!/usr/bin/env bash" :noweb yes
set -e

usage() {
    cat <<-EOF
usage: $0 <WORKSTATION_NAME>

Sets up expected link in a 'current' directory, based upon the WORKSTATION_NAME
provided as argument. Environment variable WORKSTATION_DIR is must also be set so
script can put link within.
EOF
}

if [ "$#" -ne 1 ]; then
    echo "Error: Wrong number of arguments"
    usage
    exit 55
fi

if [ "${WORKSTATION_DIR:-}" = "" ]; then
    echo "Error: environment variable WORKSTATION_DIR unset"
    usage
    exit 56
fi

source ${WORKSTATION_DIR}/lib/shell/foundation.sh
source ${WORKSTATION_DIR}/lib/shell/funcs.sh

WORKSTATION_NAME="$1"

export WORKSTATION_HOST_CURRENT_SETTINGS_DIR=$WORKSTATION_DIR/hosts/current
export WORKSTATION_HOST_SETTINGS_SRC_DIR=$WORKSTATION_DIR/hosts/$WORKSTATION_NAME

info setting current host settings directory
info workstation host settings directory: $WORKSTATION_HOST_SETTINGS_SRC_DIR

if [ -d "$WORKSTATION_HOST_CURRENT_SETTINGS_DIR" ]; then
    info "$WORKSTATION_HOST_CURRENT_SETTINGS_DIR" already exists, not changing. \
         If this is incorrect, run rm "$WORKSTATION_HOST_CURRENT_SETTINGS_DIR" \
         and then rerun this script
    exit 120
fi

if [ -d $WORKSTATION_HOST_SETTINGS_SRC_DIR ]; then
    info setting current host directory to $WORKSTATION_HOST_SETTINGS_SRC_DIR;
    ln -s $WORKSTATION_HOST_SETTINGS_SRC_DIR $WORKSTATION_HOST_CURRENT_SETTINGS_DIR;
else
    echo ERROR $WORKSTATION_HOST_SETTINGS_SRC_DIR does not exist, cannot link
    exit 5
fi
#+end_src


