workstation.org
*** Linking dotfiles
#+begin_src sh :tangle ./lib/shell/setup/link-dotfiles.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/lib/shell/funcs.sh

export FORCE=false;
export VERBOSE=false;
export CHECK=false;

function error() {
    printf "$@" >&2
    exit 1
}

function handle_force() {
    if [ "$FORCE" = "true" ]; then
        mv_dated_backup "$1"
    fi
}

function verbose() {
    if [ "$VERBOSE" = "true" ]; then
        echo "$@"
    fi
}

function check () {
    if [ "$CHECK" = "true" ] || [ "$VERBOSE" = "true" ]; then
        echo "$@"
    fi
}


function ln_helper() {
    dest=~/$2$1
    src=${WORKSTATION_DIR}/dotfiles/$1
    curr=$(readlink -f "$dest")

    if [ -L "$dest" ] && [ "$curr" = "$src" ]; then
        check "OK: $dest already points to $src"
    else
        check "NOT OK: $dest does not point to $src"
        if [ "$CHECK" = "true" ] && ! [ "$FORCE" = "true" ]; then
            exit 11
        fi

        handle_force $dest
        ln -s "$src" "$dest"
    fi
}

function ln_dotfile() {
    ln_helper $1 "."
}

function ln_norm() {
    ln_helper $1 ""
}

function ln_dotfile_n() {
    src=${WORKSTATION_DIR}/dotfiles/$1
    dest=~/.$1
    destdir=$(dirname "$dest")
    if [ ! -d $destdir ]; then
        mkdir -p $destdir
    fi

    ln_helper $1 "."
}

while (( $# > 0 )); do
    opt="$1"
    shift

    case $opt in
        -f)
            FORCE=true
            ;;
        -v)
            VERBOSE=true
            ;;
        -c)
            CHECK=true
            ;;
        *)
            error "%s: error, unknown option '%s'" "$0" "$opt"
            exit 1
            ;;
    esac
done

ln_dotfile bashrc
ln_dotfile ghci
ln_dotfile gitconfig
ln_dotfile hammerspoon
ln_dotfile nix-channels
ln_dotfile npmrc
ln_dotfile reddup.yml
ln_dotfile zshrc

ln_norm Brewfile
ln_norm Brewfile.lock.json
ln_norm bitbar

ln_dotfile_n config/git
ln_dotfile_n config/doom
#+end_src

* Nix components
** Home Manager
I use home manager as the primary method for installing and configuring software
*** flake-world equivalent to 'home-manager switch'
The pre-flake way of using home manager had a ~home-manager switch~ command
which would build and then activate the next home manager generation. This is
the flake "equivalent". Having it as a shell command makes it easier to run.

Also, this script obviously requires the ~WORKSTATION_NAME~ environment variable
to be set, which provides the 'identity' of the current machine -- not all
machines have the same home manager configurations.
#+begin_src sh :shebang "#!/usr/bin/env bash" :tangle ./lib/shell/setup/home-manager-flake-switch.sh :noweb yes
set -u # error in case WORKSTATION_NAME is not set

nix build --no-link ${WORKSTATION_DIR}/#homeConfigurations.${WORKSTATION_NAME}.$(whoami).activationPackage --show-trace

"$(nix path-info ${WORKSTATION_DIR}/#homeConfigurations.${WORKSTATION_NAME}.$(whoami).activationPackage)"/activate --show-trace

#+end_src
** Nix darwin
I actually don't use this for much of anything now, but I do know that since
home manager can't manage daemons on macos, I want to keep nix darwin around so
that I can use it for that. I had used this for setting up nix.conf, but I
decided to just unify how it was done since I have to do it another way anyway
for non-darwin machines.

Also, this script obviously requires the ~WORKSTATION_NAME~ environment variable
to be set, which provides the 'identity' of the current machine -- not all
machines have the same home manager configurations. This environment variable is
set by other mechanisms withing the workstation system.
*** command to have darwin build and switch to next generation
#+begin_src sh :shebang "#!/usr/bin/env bash" :tangle ./lib/shell/setup/nix-darwin-rebuild-flake.sh  :noweb yes
set -u # error in case WORKSTATION_NAME is not set

nix build --extra-experimental-features "nix-command flakes" \
    ~/workstation\#darwinConfigurations.${WORKSTATION_NAME}.system
./result/sw/bin/darwin-rebuild switch --flake ~/workstation#${WORKSTATION_NAME}

rm -rf ./result
#+end_src
* Post-bootstrap manual installation and setup
#+NAME: manual-setup-instructions
#+begin_src org
There are unfortunately a number of things need to install and set up
manually:
- lastpass firefox extension
- vimium-ff etension
- dropbox
- icloud
- slack
- spotify
- install haskell language server in ~/bin (or somwewhere else?) for hls

These are the settings I use for slack:
- accessibility then at bottom changbe up arrow to move focus to last message
- advanced
  - when in markdown block backticks, enter should do a newline
  - format messages with markup

mac settings
- enable screen sharing, _not_ remote management
- enable remote login
- configure hammerspoon
  - open it
  - enable accessability settings
  - launch at login
#+end_src

* System update process
this is still incomplete, but some things I think
- fetch ~/worksation and ~, if can clealy rebase, do so
- run any other kind of "sync"
- on macos, run darwin-rebuild
- run home-manager switch
- run bww sync
* System "check"
I need to have a process to check that system is OK.
* Utilities
** Passwordless sudo
Occasionally, sudo is extremely annoying. Having to type "sudo" in the middle of a nix-darwin rebuild really interrupts the flow. So here are a couple of scripts
to toggle passwordless sudo.
#+begin_src sh :tangle ./bin/enable-passwordless-sudo.sh :shebang "#!/usr/bin/env bash"
set -eo pipefail

if [[ -z "$SUDO_USER" ]]; then
    echo ERROR: run as sudo
    exit 1
fi

TEMPFILE=$(mktemp)

cat > $TEMPFILE <<EOF
$SUDO_USER  ALL=(ALL) NOPASSWD: ALL
EOF

visudo -c $TEMPFILE

mv $TEMPFILE /etc/sudoers.d/me-passwordless-sudo
#+end_src

#+begin_src sh :tangle ./bin/disable-passwordless-sudo.sh :shebang "#!/usr/bin/env bash"
set -euo pipefail

rm /etc/sudoers.d/me-passwordless-sudo
#+end_src

** Foundation settings
This is the kind of thing that sets up the "foundation" for everything else.
#+name: workstation_foundation
#+begin_src sh :tangle ./lib/shell/foundation.sh :noweb yes

export WORKSTATION_DIR="${WORKSTATION_DIR:-~/workstation}"
export WORKSTATION_EMACS_CONFIG_DIR=~/.config/emacs
export WORKSTATION_GIT_ORIGIN='git@github.com:joelmccracken/workstation.git'
export WORKSTATION_GIT_ORIGIN_PUB='https://github.com/joelmccracken/workstation.git'
export WORKSTATION_HOST_CURRENT_SETTINGS_DIR=$WORKSTATION_DIR/hosts/current

sourceIfExists () {
    if [ -f "$1" ]; then
        source "$1"
    fi
}

if [ -z "${WORKSTATION_NAME+x}" ] ; then
    sourceIfExists "$WORKSTATION_HOST_CURRENT_SETTINGS_DIR/settings.sh"
fi


if [ -z "${WORKSTATION_NAME+x}" ] ; then
    echo WARNING: no environment variable WORKSTATION_NAME provided.
    echo This variable should be exported by a script at:
    echo $WORKSTATION_DIR/hosts/current/settings.sh
    echo see workstation.org for more information
else
    export WORKSTATION_HOST_SETTINGS_SRC_DIR=$WORKSTATION_DIR/hosts/$WORKSTATION_NAME
fi
#+end_src

** library of shell functions
This single file contains many of the general-purpose functions that I use in
numerous scripts etc.
#+begin_src sh :tangle ./lib/shell/funcs.sh :shebang "#!/usr/bin/env bash" :noweb yes

«is_mac_function»

«is_linux_function»

«info_function»

«bw_unlock_function»

«polite_git_checkout_function»

«mv_dated_backup_function»

«is_git_repo_cloned_at_function»

«clone_repo_and_checkout_at_function»
#+end_src
** Polite git checkout
This script provides a way to check out a repository in a directory without
clobbering the existing contents of the directory. This is useful in case the
directory might have contents that you wish to save, and you think it might be
handy to be able to i.e. ~git diff~ the contents against what git knows about
in the repository, once all of the trivial differences have been resolved (i.e.
files missing are put into place).

I used to use this for setting up dotfiles, however, I've changed the approach,
but I still think this script is handy and want to hang on to it.
#+begin_src sh :tangle ./bin/polite-git-checkout.sh :shebang "#!/usr/bin/env bash" :noweb yes
«polite_git_checkout_function»
polite-git-checkout $1 $2
#+end_src
#+name: polite_git_checkout_function
#+begin_src sh
function polite-git-checkout () {
    DIR=$1
    REPO=$2
    ORIGIN=$3

    cd $DIR
    git init
    git remote add origin $REPO
    git fetch

    # wont work (it will have already been deleted from the index)
    git reset --mixed origin/master
    # This formulation of the checkout command seems to work most reliably
    git status -s | grep -E '^ D' | sed -E 's/^ D //' | xargs -n 1 -- git checkout
    # fixing; used public to start, but want to be able to push
    git remote set-url origin $ORIGIN
}
#+end_src
* Bitwarden and personal secrets
I have a script to set up and download various "private" information.
for various reasons I've decided to try bitwarden for this, but
out of the box bitwarden doesn't really do what I need it to.

This restores SSH keys to my local computer.
These can't be in git, and really they are essential for any meaningfully
complete workstation setup.
** bw_unlock bash function
The ~bw_unlock~ function sets the ~BW_SESSION~ environment variable in the
current shell process, which is required in order to query the bitwarden
password database.
#+NAME: bw_unlock_function
#+begin_src sh
# unlocks bitwarden, so that the `bw` program can access the bitwarden database.
bw_unlock () {
    # authtenticates bitwarden for this shell session only
    export BW_SESSION=`bw unlock --passwordfile ~/secrets/bw_pass --raw`;
}
#+end_src
* Hosts: profiles for individual machines
One of the issues that is inherent in workstation configuration is variation
between individual workstations. I have different configuation needs on machines
for work use and for personal use.

There are many possible ways to handle this, but the one I use here is to have
the configurations unique to each machine in specific subdirectories (i.e.
~workstation/hosts/glamdring~, ~workstation/hosts/angrist~, etc), and then have
the _current_ configuration specified by a symlink from
${WORKSTATION_DIR}/hosts/current~ to one of the other directories. I can then put
whatever is convenient in those directories (shell scripts, emacs lisp), and
have other systems read from there.

Kinda ugly, but it works.
** glamdring/
#+begin_src emacs-lisp :tangle ./hosts/glamdring/README.md :noweb yes
# About
glamdring: My primary computer/workstation
#+end_src

#+begin_src emacs-lisp :tangle ./hosts/glamdring/config.el :noweb yes
(after! org
  (setq org-directory "~/EF/")
  (setq org-roam-directory "~/EF/")
  (setq org-roam-db-location "~/EF/org-roam.glamdring.db")

  ;; for now wont be able to org-mobile-push from glamdring
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
  (setq org-directory "~/EF")
  (setq org-id-locations-file "~/EF/.orgids.el")
  (setq org-agenda-files '("~/EF/actions.org" "~/EF/projects.org"))
  (setq +org-capture-notes-file "inbox.org")
  (setq org-mobile-files (org-agenda-files))
  (setq org-mobile-inbox-for-pull "~/EF/inbox-mobile.org"))
#+end_src

#+begin_src sh :tangle ./hosts/glamdring/zshrc.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/hosts/glamdring/settings.sh
#+end_src

#+begin_src sh :tangle ./hosts/glamdring/settings.sh :shebang "#!/usr/bin/env bash" :noweb yes
export WORKSTATION_NAME=glamdring
#+end_src
** anduril/
** aeglos/
#+begin_src emacs-lisp :tangle ./hosts/aeglos/config.el :noweb yes
(after! org
  (setq org-directory "~/Dropbox/EF/")
  (setq org-roam-directory "~/Dropbox/EF/")
  (setq org-roam-db-location "~/Dropbox/EF/org-roam.aeglos.db")

  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
  (setq org-directory "~/Dropbox/EF")
  (setq org-id-locations-file "~/Dropbox/EF/.orgids.el")
  (setq org-agenda-files '("~/EF/actions.org" "~/EF/projects.org"))
  (setq +org-capture-notes-file "inbox.org")
  (setq org-mobile-files (org-agenda-files))
  (setq org-mobile-inbox-for-pull "~/Dropbox/EF/inbox-mobile.org"))
#+end_src

#+begin_src sh :tangle ./hosts/aeglos/zshrc.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ${WORKSTATION_DIR}/hosts/aeglos/settings.sh
#+end_src

#+begin_src sh :tangle ./hosts/aeglos/settings.sh :shebang "#!/usr/bin/env bash" :noweb yes
export WORKSTATION_NAME=aeglos
#+end_src
** ci/
