workstation.org
** belthronding
#+begin_src emacs-lisp :tangle ./hosts/belthronding/README.md :noweb yes
# About
belthronding: my cloud ubuntu machine on DO
#+end_src

#+begin_src emacs-lisp :tangle ./hosts/belthronding/config.el :noweb yes
(after! org
  (setq org-directory "~/EF/")
  (setq org-roam-directory "~/EF/")
  (setq org-roam-db-location "~/EF/org-roam.belthronding.db")

  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
  (setq org-directory "~/EF")
  (setq org-id-locations-file "~/EF/.orgids.el")
  (setq org-agenda-files '("~/EF/actions.org" "~/EF/projects.org"))
  (setq +org-capture-notes-file "inbox.org")
  (setq org-mobile-files (org-agenda-files))
  (setq org-mobile-inbox-for-pull "~/EF/inbox-mobile.org"))
#+end_src

#+begin_src sh :tangle ./hosts/belthronding/zshrc.sh :shebang "#!/usr/bin/env bash" :noweb yes
source ~/workstation/hosts/belthronding/settings.sh
#+end_src

#+begin_src sh :tangle ./hosts/belthronding/settings.sh :shebang "#!/usr/bin/env bash" :noweb yes
export WORKSTATION_NAME=belthronding
#+end_src
*** Cron file
I have set up a crontab process for automatic synchronization of my personal
notes.
#+begin_src sh :tangle ./hosts/belthronding/crontab :noweb yes
# (Cron version -- $Id: crontab.c,v 2.13 1994/01/17 03:20:37 vixie Exp $)
# Edit this file to introduce tasks to be run by cron.
#
# Each task to run has to be defined through a single line
# indicating with different fields when the task will be run
# and what command to run for the task
#
# To define the time you can provide concrete values for
# minute (m), hour (h), day of month (dom), month (mon),
# and day of week (dow) or use '*' in these fields (for 'any').
#
# Notice that tasks will be started based on the cron's system
# daemon's notion of time and timezones.
#
# Output of the crontab jobs (including errors) is sent through
# email to the user the crontab file belongs to (unless redirected).
#
# For example, you can run a backup of all your user accounts
# at 5 a.m every week with:
# 0 5 * * 1 tar -zcf /var/backups/home.tgz /home/
#
# For more information see the manual pages of crontab(5) and cron(8)
#
# m h  dom mon dow   command
*/5 * * * * /home/joel/workstation/bin/cron-5.sh

#* * * * * /home/joel/workstation/bin/cron-5.sh
# uncomment ^^ for use during development

# run to install:
#   $ crontab ~/workstation/lib/misc/crontab

#+end_src



* Testing
** test.sh
At this point in time, this test actually checks very little, but what it DOES check
is things that indicate that everything went right. Specifically, checking the doom version means
emacs, doom, and the whole doom setup process worked out.

I plan to move this to a Haskell project at some point, probably do it with hspec instead.
Or maybe that bats testing library. We'll see.
#+begin_src sh :tangle ./test/test.sh :shebang "#!/usr/bin/env bash" :noweb yes
set -euox pipefail

set +u
# evaluating this with set -u will cause an unbound variable error
source $HOME/.nix-profile/etc/profile.d/hm-session-vars.sh
set -u

source ${WORKSTATION_DIR}/lib/shell/foundation.sh

function find_emacs_init() {
  init_file="";
  for x in "$WORKSTATION_EMACS_CONFIG_DIR/early-init.el" "$WORKSTATION_EMACS_CONFIG_DIR/init.el"; do
    if [[ -f "$x" ]]; then
      init_file="$x"
      break;
    fi;
  done;
  if [[ "$init_file" = "" ]]; then
    echo "Error: Could not find emacs init file" 1>&2
    exit 43
  else
    echo "$init_file"
  fi
}

emacs_init="$(find_emacs_init)"


function assert_input() {
  local label=$1
  local expected=$2
  local actual
  read actual

  if [[ "$expected" == "$actual" ]]; then
    echo "$label is correct"
  else
    echo "$label is not correct, found '$actual', expected '$expected'"
    exit 1
  fi
}

echo "RUNNING TESTS"

EMACS_PATH=~/.nix-profile/bin/emacs
# emacs
if [ -x "$EMACS_PATH" ]; then
    echo found emacs
else
    echo EMACS NOT FOUND
    exit 1
fi

$EMACS_PATH -Q --batch --eval '(progn (princ emacs-version) (terpri))' | {
  read actual
  if [[ "$actual" == "27.1" || "$actual" == "27.2" || "$actual" == "28.1" || "$actual" == "28.2" ]]; then
    echo "emacs version is correct"
  else
    echo "emacs version is not correct, found '$actual', expected 27.1, 27.2, 28.1, or 28.2"
    exit 1
  fi
}

$EMACS_PATH -l "$emacs_init" --batch --eval '(progn (princ doom-version) (terpri))' | {
  read actual;
  if [[ "$actual" == "21.12.0-alpha" || "$actual" == "3.0.0-dev" || "$actual" == "3.0.0-pre" ]]; then
    echo "doom version is correct"
  else
    echo "doom version is not correct, found '$actual', expected 21.12.0-alpha, 3.0.0-dev, or 3.0.0-pre"
    exit 1
  fi
}

if $EMACS_PATH -l "$emacs_init" --batch --eval "(progn (require 'vterm-module nil t))"; then
  echo "emacs is able to load vterm-module, so vterm-module is compiled and ready to go";
else
  echo "error: emacs was not able to load vterm-module";
  exit 1
fi

if [ -f ~/secrets/test_secret ]; then
    echo "test secret file sucessfully synced"
    cat ~/secrets/test_secret
else
    echo "error: test secret file was missing"
fi

echo "TESTS COMPLETE"
#+end_src
** Github Actions CI
Importantly, github CI support macos environments.

Daily build to ensure that potential problems get caught (NB: I have had issues
where a working setup no longer worked due to bit rot, which would have been
caught with a regular build like this).

I am running up close to maximum execution time, so very likely I will need to
refactor/come up with some other way to do this.

- docs on different available runners can be found here
  - https://docs.github.com/en/actions/using-github-hosted-runners/about-github-hosted-runners/about-github-hosted-runners#standard-github-hosted-runners-for-public-repositories
#+begin_src yaml :tangle ./.github/workflows/test.yml :noweb yes
name: CI

on:
  push:
  schedule:
  - cron: '0 0 * * *'  # every day at midnight

jobs:
  build:
    strategy:
      matrix:
        os:
        # https://docs.github.com/en/actions/using-github-hosted-runners/about-github-hosted-runners/about-github-hosted-runners#standard-github-hosted-runners-for-public-repositories
        - macos-13 # x86
        - macos-latest # aarch
        - ubuntu-latest
    runs-on: ${{ matrix.os }}
    steps:
    - uses: actions/checkout@v3

    - name: Run a one-line script
      env:
        BW_CLIENTID: ${{ secrets.BW_CLIENTID }}
        BW_CLIENTSECRET: ${{ secrets.BW_CLIENTSECRET }}
        WS_BW_MASTER_PASS: ${{ secrets.WS_BW_MASTER_PASS }}
      run: ./test/ci.sh

    # TODO run a check that no files change after tangling, e.g. git diff comes back clean
#+end_src
** The environment setup script
To run CI, we have a script which, thankfully, basically mirrors the install instructions.

Importantly, this does a LOT of things, such as install nix, home-manager, etc, and eventually runs
the test script.
#+begin_src sh :tangle ./test/ci.sh :shebang "#!/usr/bin/env bash" :noweb yes

set -xeuo pipefail

# env # are there environment variables where I can get the commit sha?

cd ~

if [ "$GITHUB_SHA" == "" ]; then
    WORKSTATION_BOOTSTRAP_COMMIT=master
else
    WORKSTATION_BOOTSTRAP_COMMIT="$GITHUB_SHA"
fi

curl https://raw.githubusercontent.com/joelmccracken/workstation/$WORKSTATION_BOOTSTRAP_COMMIT/bootstrap-workstation.sh > bootstrap-workstation.sh

echo BEGINNING INITIAL INSTALL

# disable native compilation, too slow for CI
export DOOM_DISABLE_NATIVE_COMPILE=true

if [ "$RUNNER_OS" == "macOS" ]; then
    bash bootstrap-workstation.sh ci-macos $WORKSTATION_BOOTSTRAP_COMMIT
else
    bash bootstrap-workstation.sh ci-ubuntu $WORKSTATION_BOOTSTRAP_COMMIT
fi

echo INSTALL PROCESS COMPLETE, TESTING

bash ${WORKSTATION_DIR}/test/test.sh
#+end_src
* TODO tasks
- cron thing
  - document how to work with it
  - and script cronfile installation
- check if current username is different from expected username
- use flake.nix to generate the different username/pw settings;
  - or... generate the targets of flake.nix from expected combos?
- [ ] there are lots of weird little things that have accumulated in
  bootstrap-workstation.sh; try to clean some of them up
  - many things in bootstrap-workstation.sh should also become helper scripts in bin
    - mv_dated_backup
    - install git (mac and linux)? homebrew? nix?
    - restart nix daemon, linux/macos
    - build_wshs
    - ws (an executable to run the currently built wshs), bww
  - for various installations, document the interesting parts of each
    and have subsections of the workstation config
- [ ] change setting of WORKSTATION_BOOTSTRAP_COMMIT to use env var
  its awkward having it be a cli arg, I feel the need to explain
  when we need to use it
- [ ] better document all of the workstation names that are available
- [ ] create mechanism to run for updating workstations
  - download updates to master branch of dotfiles and workstation
  - run nix stuffs when appropriate
  - maybe do bww sync?
- [ ] move various code not in workstation.org into this file
  - machine settings for each machine in workstation/hosts
  - bww
  - the ws code
  - various code in lib
- [ ] finish filling in the numerous incomplete sections of prose in this document
- [ ] devise method to prevent committing manually-edited target files
  - git pre-commit-hook?
  - github action CI that runs tangle, checks for differences
- [ ] rebuild my personal laptop once all of this is stable
- [ ] port test/test.sh into wshs/haskell
- [ ] laptop-state-checking script/features
  - ensure secrets/bw_pass exists
  - ensure other secrets are there
    - check that no new secrets need to be synced
      - if any secrets have changed, list the changes
  - check if can access/ssh/etc into some other machines
  - check for updates on workstation origin
  - checks for nix (~nix store verify --all~ and ~nix-doctor~)
  - check for brew updates/state and presence of brew executable
    - brew doctor?
  - check reddup state
  - check for various execuables I care about
    - (e.g. each thing specifially installed)
    - haskell language server versions
  - check for any changes/differences in ~/
- [ ] setup hammerspoon, and especially spacehammer
- [ ] rebuild belthronding/my cloud machine
  - (has had lots of manual hacking)
- [ ] build nixos sever on gandi
- [ ] document various components of bww sync
  - how it works
  - how to use it
  - document/alert if going to replace a file with server version
    - display diff of files
- [ ] get rid of rming results when darwin-rebuild script finishes (use path
  technique from home manager script)
- [ ] move host settings into this file
** quick planning for server config needs
(in rough order need to complete, to get to server-config phase of project)
goal is to get ready to provision/set up nixos cloud machines
1. [ ] use bww to sync/restore secrets on workstations
2. [ ] create a new host for nixos server
3. [ ] create script to sync updates from changes to workstation and dotfiles
   - does something like https://nixos.wiki/wiki/NixOps help?
4. [ ] figure out way to run update script on hosts that need it.
5. [ ] experiement with https://docs.hercules-ci.com/arion/ for running
   nextcloud (most urgent cloud service I want to use)
6. [ ] set up "intelligent" s3 bucket for
* COMMENT Local Variables
These are set like this so that the noweb characters don't conflict with shell
HEREDOC syntax, breaking syntax highlighting/indentation etc.
# Local Variables:
# org-babel-noweb-wrap-start: "«"
# org-babel-noweb-wrap-end: "»"
# End:
